Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/enforcement_and_redress/equality_tribunal.html.txt.tmx
Source language: en
Languages: ga

source: Disputes about equality and discrimination
ga: Díospóidí maidir le comhionannas agus idirdhealú

source: The Workplace Relations Commission (WRC) now deals with all complaints of discrimination in employment and access to goods and services
ga: Déileálann an Coimisiún um Chaidreamh san Áit Oibre (WRC) anois le gach gearán a bhaineann le hidirdhealú san fhostaíocht agus i rochtain ar earraí agus seirbhísí

source: These complaints (formerly handled by the Equality Tribunal whose functions were transferred to the WRC on 1 October 2015) come under the following equality legislation:
ga: Tagann na gearáin sin (arna láimhseáil ag an mBinse Comhionannais roimhe seo a aistríodh a chuid feidhmeanna chuig an WRC an 1 Deireadh Fómhair 2015) faoin reachtaíocht chomhionannais seo a leanas:

source: • The Employment Equality Acts 1998–2015, which outlaw discrimination at work including as regards: recruitment and promotion; equal pay; working conditions; training or experience; dismissal; and harassment, including sexual harassment
ga: • Na hAchtanna um Chomhionannas Fostaíochta 1998–2015, a eisreachtaíonn idirdhealú ag an obair maidir le: earcaíocht agus ardú céime; pá comhionann; coinníollacha oibre; oiliúint agus taithí; dífhostú; agus ciapadh, lena n-áirítear gnéaschiapadh

source: You can find out more about this legislation in our document, Equality in the workplace
ga: Féadfaidh tú tuilleadh a fháil amach faoin reachtaíocht seo inár gcáipéis, Comhionannas san áit oibre

source: • The Equal Status Acts 2000–2015, which outlaw discrimination outside the workplace, in particular in the provision of goods and services; in selling, renting or leasing property (including the "housing assistance ground") and in certain aspects of education
ga: • Na hAchtanna um Stádas Comhionann 2000–2015, a eisreachtaíonn idirdhealú lasmuigh den áit oibre, go háirithe maidir le soláthar earraí agus seirbhísí; maoin a dhíol, a chur ar cíos nó a léasú, lena n-áirítear an cúis le haghaidh cúnaimh tithíochta; agus i ngnéithe áirithe oideachais

source: There is information about employment equality and equal status, as well as a list of frequently asked questions, on workplacerelations.ie
ga: Tá faisnéis maidir le comhionannas fostaíochta agus stádas comhionann, chomh maith le liosta ceisteanna coitianta, ar workplacerelations.ie

source: The Irish Human Rights and Equality Commission also provides information to the public on equality legislation
ga: Cuireann Coimisiún na hÉireann um Chearta agus Chomhionannas an Duine faisnéis ar fáil chomh maith don phobal maidir le reachtaíocht comhionannais

source: Victimisation is also covered by equality legislation
ga: Clúdaíonn reachtaíocht chomhionannais íospairt chomh maith

source: Victimisation occurs when a person is treated less favourably than another because they opposed discrimination or were involved in a complaint of unlawful discrimination
ga: Tarlaíonn íospairt nuair nach gcaitear chomh fabhrach céanna le duine amháin agus a chaitear le duine eile toisc iad a bheith i gcoinne idirdhealú nó go raibh siad páirteach i ngearán maidir le hidirdhealú neamhdhleathach

source: The Workplace Relations Commission also deals with complaints of discrimination on the grounds of gender under the Pensions Acts 1990–2015 in relation to occupational benefit or pensions schemes
ga: Déileálann an Coimisiún um Chaidreamh san Áit Oibre le gearáin idirdhealaithe ar fhorais inscne faoi na hAchtanna Pinsean 1990-2015 i ndáil le sochar ceirde nó scéimeanna pinsean

source: However, it cannot deal with complaints about licensed premises and registered clubs
ga: Ní féidir leis déileáil le gearáin maidir le háitribh cheadúnaithe agus cumainn chláraithe áfach

source: To pursue a complaint about a licensed premises or registered club you must take your case to the District Court
ga: Chun coinneáil le gearán maidir le háitribh cheadúnaithe nó cumann cláraithe ní mór duit do chás a thabhairt chuig an gCúirt Dúiche

source: The 2 methods of handling equality or discrimination disputes are mediation and adjudication
ga: Is iad an dá mhodh atá ann chun déileáil le díospóidí comhionannais nó idirdhealaithe ná idirghabháil agus breithniú

source: When you make your complaint under equality legislation, you may be offered mediation
ga: Nuair a dhéanann tú gearán faoi reachtaíocht comhionannais, d’fhéadfaí go dtairgfí idirghabháil duit

source: It is a voluntary and confidential process
ga: Is próiseas deonach agus rúnda é

source: Mediation is an attempt to get agreement between the parties
ga: Is éard is idirghabháil ann ná iarracht teacht ar réiteach idir na páirtithe

source: At the end of mediation both sides sign an agreement which is legally binding so that both sides must keep to the terms of the decision
ga: Ag deireadh na hidirghabhála síníonn an dá thaobh comhaontú atá ina cheangal dlí le go gcaithfidh an dá thaobh cloí le téarmaí an chinnidh

source: Mediation is held in private and the agreement is not published
ga: Déantar idirghabháil go príobháideach agus ní fhoilsítear an comhaontú

source: If you do not reach an agreement through mediation you can request your case be brought to investigation
ga: Mura dtagann tú ar chomhaontú trí hidirghabháil féadfaidh tú iarratas a dhéanamh go bhfiosrófar do chás

source: If you do not reach an agreement through mediation, your case will be referred to an adjudication officer
ga: Mura dtagann tú ar chomhaontú trí idirghabháil, déanfar do chás a tharchur chuig oifigeach breithnithe

source: You can read more about mediation on workplacerelations.ie
ga: Féadfaidh tú tuilleadh a léamh faoi idirghabháil ar workplacerelations.ie

source: If mediation is not used or is not successful, the complaint or dispute is referred to an adjudication officer who will conduct an inquiry and issue a legally binding decision
ga: Mura n-úsáidtear idirghabháil nó mura n-éiríonn le hidirghabháil déantar an gearán nó díospóid a tharchur chuig oifigeach breithnithe a dhéanfaidh fiosrúchán agus a eiseoidh cinneadh atá ina cheangal dlí

source: Remedies will include one or more of the following: compensation, an order for equal pay or equal treatment, and/or an order that somebody take a specified action
ga: Áireofar ar na leigheasanna ceann amháin nó níos mó den mhéid seo a leanas: cúiteamh, ordú maidir le pá comhionann nó caitheamh go cothrom le duine agus/nó ordú go ndéanfaidh duine éigin gníomh ar leith

source: Advice may be available from a trade union, support group, Citizens Information Centre or the Irish Human Rights and Equality Commission
ga: D’fhéadfadh comhairle a bheith ar fáil ó cheardchumann, grúpa tacaíochta, Ionad Faisnéise do Shaoránaigh nó Coimisiún na hÉireann um Chearta agus Comhionannas an Duine

source: In general, complaints under the Employment Equality Acts 1998–2015 and complaints about discrimination in pensions must be brought within 6 months
ga: Go ginearálta, ní mór gearáin faoi na hAchtanna um Chomhionannas Fostaíochta 1998–2015 agus gearáin faoi idirdhealú i bpinsin a thabhairt laistigh de 6 mhí

source: You should make your complaint using the online complaint form available on workplacerelations.ie
ga: Ba chóir duit do ghearáin ag úsáid foirm ghearáin ar líne atá ar fáil ar workplacerelations.ie

source: The time limit can be extended by a further 6 months for "reasonable cause"
ga: Is féidir an sprioc ama a shíneadh 6 mhí bhreise mar gheall ar "ghníomh réasúnach"

source: To make a complaint under the Equal Status Acts 2000–2015 you must first notify the person or organisation you are making the complaint against within 2 months of the last act of discrimination
ga: Chun gearán a dhéanamh faoi na hAchtanna um Stádas Comhionann 2000–2015 ní mór duit i dtosach báire an duine nó an eagraíocht a bhfuil tú ag déanamh gearán ina leith a chur ar an eolas laistigh de 2 mhí den ghníomh deireanach idirdhealaithe

source: To do this you complete ES.1 form (pdf) and send it to the person or organisation you are making the complaint against
ga: Chun sin a dhéanamh ní mór duit ES.1 form (pdf) a chomhlánú agus a sheoladh chuig an duine nó an eagraíocht a bhfuil tú ag déanamh gearán ina leith

source: The time limit for notification can be extended to 4 months by the Director General of the Workplace Relations Commission
ga: Is féidir le hArd-Stiúrthóir an Choimisiúin um Chaidreamh san Áit Oibre an sprioc ama a shíneadh go dtí 4 mhí

source: If you are not satisfied with the service provider's response, or if they have made no response within 1 month from the date you notified them, and you wish to pursue the complaint, you should use the online complaint form available on workplacerelations.ie
ga: Mura bhfuil tú sásta le freagra an soláthróra seirbhíse, nó mura bhfuil aon fhreagra tugtha acu laistigh de 1 mí ón dáta a chur tú ar an eolas iad, agus má theastaíonn uait an gearán a leanúint ba chóir duit an fhoirm ghearáin ar líne atá ar fáil ar workplacerelations.ie a úsáid

source: All decisions of an adjudication officer can be appealed, to the Labour Court for employment and pensions cases and to the Circuit Court for equal status cases, within 42 days of the issue of the decision. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Is féidir achomharc a dhéanamh ar gach cinneadh a dhéanann an t-oifigeach breithnithe, chuig an gCúirt Oibreachais maidir le cásanna fostaíochta agus pinsean agus chuig an gCúirt Chuarda maidir le cásanna stádais chomhionainn, laistigh de 42 lá ó eisiúint an chinnidh
